GiWduL4/WiMi/Labortechnik/DMD/Texas Instruments-DLP/DLPLCRSoftwareBundle-3.0/DLP3000-C300REF-MSP430-SourceCode-v3.0/dlpc300_LightCrafter.c
/**************************************************************************************************************************************************
*                                 Copyright © 2012 Texas Instruments Incorporated - http://www.ti.com/                                            *
***************************************************************************************************************************************************
*  Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: *
*                                                                                                                                                 *
*    Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.                 *
*                                                                                                                                                 *
*    Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the        *
*    documentation and/or other materials provided with the distribution.                                                                         *
*                                                                                                                                                 *
*    Neither the name of Texas Instruments Incorporated nor the names of its contributors may be used to endorse or promote products derived      *
*    from this software without specific prior written permission.                                                                                *
*                                                                                                                                                 *
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT          *
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT     *
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT         *
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY    *
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE      *
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                                                                           *
***************************************************************************************************************************************************/

#include "common.h"
#include "msp430f2232.h"
#include "dlpc300_LightCrafter_pins.h"
#include "dlpc300.h"
#include "i2c_master.h"
#include "dlpc300_LightCrafter.h"

#if 0	// ONLY FOR DEBUG
#pragma DATA_SECTION (BOOT, ".boot");
#pragma DATA_ALIGN   (BOOT, 2);
const unsigned char   BOOT[0x200] = {
#include "boot.h"
};
#endif

typedef void (*voidFcn)(void);

#define LED_MAX_ON_TIME		35	// (2.24sec @ 65ms timer tick)

#define THERMISTOR_SENSING	1	// LightEngine overtemperature sensing
#define FAN_ON				0
#define LED_DRIVER_SENSING	0	// If LED_DRIVER_SENDING is enabled (1) and R139 on driver board is not installed, LightCrafter will enter shutdown mode after booting.
#define LED_ENABLE_SENSING	1	// LED_ANODE overvoltage sensing using LED_ENABLE
#define SYS_VOLTAGE_SENSING 1	// Check that system power is within operating voltages
#define SYS_VOLTAGE_AVE_NUM	3	// Number of system voltage measurements to average (3*65msec=195msec)
#define BLINKING_LED        0
#define EVT					0

#define BOOT_BSL_ENTRY		0xC00
 
// global variables
uint08 PowerIsOn;
uint08 FirstPowerUp = 0;
uint08 EnableSafetyChecks = TRUE;
uint16 VRef1 = 0;
uint16 VRef2 = 0;
uint16 DMDVoltage = 0;
uint16 led_driver_sense = 0;   // LEDDRV_SENSE = 0.12 * LED Current
uint16 sys_voltage = 0;
uint16 sys_voltage_cnt = 0;
uint16 sys_voltage_sum = 0;
uint16 sys_voltage_avg = 0;
uint16 thermistor = 0;
uint08 led_timeout = 0;
uint16 adc_vals[15] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
display_mode_t display_mode = disp_mode_splash;
adjust_mode_t adjust_mode = adjust_mode_disp;


/*----------------------------------------------------------------------------+
| Main Routine                                                                |
+----------------------------------------------------------------------------*/
void main( void )
{
  	// Stop watchdog timer to prevent time out reset
  	WDTCTL = WDTPW + WDTHOLD + WDTNMI;
        
  	// Initiallize IO ports
  	Init_Ports();
  	

  	FirstPowerUp = 1;
  	PowerIsOn = 0;
  	__bis_SR_register(GIE);
  	P1IFG = SW_POWER;
  	
  	Init_TimerA3();
    
    while (1) 
    {
    	// after the power on interrupt, go to power mode 0
    	// Enter LPM0 w/ interrupt
    	__bis_SR_register(LPM0_bits + GIE);


    	// Enter LPM4 w/ interrupt
    	__bis_SR_register(LPM4_bits + GIE);
  	}
}

/*----------------------------------------------------------------------------+
| System Initialization Routines.
+----------------------------------------------------------------------------*/
void Init_TimerA3(void)
{
  TACTL = TASSEL_2 + MC_1 + TACLR;  // SMCLK, continuous mode, clear TAR
  TACCR0 = 65535;					// setup for Timer A - 65 msec timeout rate
  TACCTL0 = CCIE;                   // CCR0 interrupt enabled
}
  
/////////////////////////////////////////////////////////////////////////////////////////
void Init_Ports(void)
{
  // Setup GPIOs
  /* Pin  Function Type       Init Value	Interrupt           DM365 Conn	Schematic Name
   * P1.0	GPIO	Input					YES (Rising Edge)				INIT_DONE_DPP
   * P1.1	GPIO	Input	                 						YES		BSL_TX_MSP
   * P1.2	GPIO	Input					YES (Rising Edge)				RED_EN
   * P1.3	GPIO	Input					YES (Rising Edge)				GRN_EN
   * P1.4	GPIO	Input					YES (Rising Edge)				BLU_EN
   * P1.5	GPIO	Input					YES (Falling Edge)				LED_ENABLE
   * P1.6	GPIO	Input					YES (Falling Edge)				SW_POWER
   * P1.7	GPIO	Open Drain	HIGH		YES (Falling Edge)		YES		MSP_WAKEUP
   */
    P1OUT   = 0;    // Set Output low
    P1SEL   = 0;    // Select GPIO capability in Port P1
    P1DIR   = 0;    // Set GPIO as inputs
 

                       

  /* P2.0	ADC_IN	A0						Timely POLL						THERMISTOR
   * P2.1	ADC_IN	A1						Timely POLL						LOW_BAT
   * P2.2	GPIO	Input											YES		BSL_RX_MSP
   * P2.3	GPIO	Output		HIGH								YES		SYS_FAULTZ
   * P2.4	GPIO	Output		HIGH										SYS_PWRONZ
   * P2.5	GPIO	Input					Read during power down	YES		MSP_P2_5
   * P2.6	GPIO	OpenDrain	HIGH										SYSRESETZ
   * P2.7	GPIO	Input					Yes (Falling Edge)				PROG_EN_DM
   */ 
      // Set P2.7 low, P2.6 low, P2.5 low, P2.4 high, P2.3 high, P2.2 low, P2.1 low, P2.0 low
      // Select GPIO capability in Port P2, ADC capability is set in ADC10AE0
      // Set P2.7(I), P2.6(O), P2.5(I), P2.4(O), P2.3(I), P2.2(I), P2.1(I), P2.0(I)
    P2OUT   = (SYS_PWRONZ | SYS_FAULTZ ); 
    P2SEL   = 0;    
    P2DIR   = (SYS_PWRONZ | SYSRESETZ); 
 
  /* P3.0	ADC_IN	A5						Read At PowerUp					DMD_VOLTAGE
   * P3.1	I2C_SDA	Bidi		HIGH								YES		SDA
   * P3.2	I2C_SCL	Bidi		HIGH								YES		SCL
   * P3.3	GPIO	Output		LOW									YES		EXT_I2COE
   * P3.4	GPIO	Output		HIGH								YES		SPIPROGZ
   * P3.5	GPIO	Output		HIGH										LED_ENABLEZ
   * P3.6	GPIO	Output		LOW											PWREN_INTF
   * P3.7	GPIO	Output		LOW											POWERGOOD
   */
      // Set P3.7 low, P3.6 low, P3.5 high, P3.4 high, P3.3 high, P3.2 low, P3.1 low, P3.0 low
      // Select GPIO capability in Port P3, except for I2C. ADC capability is set in ADC10AE0
      // Set P3.7(O), P3.6(O), P3.5(O), P3.4(I), P3.3(I), P3.2(I), P3.1(I), P3.0(I)   
    P3OUT   = (LED_ENABLEZ | EXT_I2COE | SPIPROGZ ); 
    P3SEL   = (SDA | SCL); 
    P3DIR   = (POWERGOOD | PWREN_INTF | LED_ENABLEZ ); 

  /* P4.0	GPIO	Output		LOW											FAN_PWM
   * P4.1	GPIO	Input					Poll					YES		DLP_OFF_DM
   * P4.2	GPIO	OpenDrain	HIGH										DM_3V3_PWR_SEQ
   * P4.3	ADC_IN	A12						ADC Sample 						LEDDRV_SENSE
   * P4.4	ADC_IN	A13						Read At PowerUp					VREF2
   * P4.5	GPIO	Input					Poll         			YES		MSP_P4_5
   * P4.6	GPIO	Output		LOW											PWREN_CORE
   * P4.7	GPIO	OpenDrain	LOW											RESETZ
   */
      // Set P4.7 low, P4.6 low, P4.5 low, P4.4 low, P4.3 low, P4.2 low, P4.1 low, P4.0 low
      // Select GPIO capability in Port P4, ADC capability is set in ADC10AE1
      // Set P4.7(O), P4.6(O), P4.5(I), P4.4(I), P4.3(I), P4.2(O), P4.1(I), P4.0(O) 
#if FAN_ON
	P4OUT = (FAN_PWM);
#else
    P4OUT   = 0; 
#endif
    P4SEL   = 0;    
    P4DIR   = (RESETZ | PWREN_CORE | FAN_PWM | DM_3V3_PWR_SEQ);    
 
  

 	
 
