GiWduL4/WiMi/Labortechnik/DMD/Texas Instruments-DLP/DLPLCRSoftwareBundle-3.0/DLP3000-C300REF-MSP430-SourceCode-v3.0/dlpc300_LightCrafter.c
  	// Setup Interrupts
    // Set P1.7, P1.6, and P1.5 as falling edge interrupt
    // Set P1.4, P1.3, P1.2, P1.1, P1.0 as rising edge interrupt
    P1IES   = (MSP_WAKEUP | SW_POWER | LED_ENABLE); 

      // Set P2.7 as rising edge interrupt
    P2IES   = 0; 
    P2IFG   = 0;     // Clear flags
    P2IE     = PROG_EN_DM; // Enable PROG_EN_MSP interrupt

  // Setup Analog Inputs
  ADC10AE0  =  ((DMD_VOLTAGE << 5) | LOW_BAT | THERMISTOR);  // analog pins A5, A1 and A0
  ADC10AE1  = (VREF2 | LEDDRV_SENSE) << 1;        // analog pins A13, A12

  // hold I2C in reset to conserve power
  UCB0CTL1 |= UCSWRST;

  	// 1MHz main clock
  	// Read valid calibration data and store in appropriate registers
  	if ( (CALDCO_1MHZ != 0xFF) || (CALBC1_1MHZ != 0xFF) ) 
  	{
    	BCSCTL1 = CALBC1_1MHZ;
    	DCOCTL = CALDCO_1MHZ;
  	} 
  	else 
  	{ // calibration data is invalid
    	BCSCTL1 = 0x87;
    	DCOCTL = 0x6F;
  	}
  	
  	P1IFG   = 0;     // Clear flags
  	P1IE = (SW_POWER);  
}


////////////////////////////////////////////////
// Timer0 A0 interrupt service routine.

#pragma vector=TIMERA0_VECTOR
__interrupt void TIMERA_ISR(void)
{
	
#if BLINKING_LED
   		if (P2OUT & SYS_FAULTZ)
		{
			P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
		}
		else
   		{
   			P2OUT |= SYS_FAULTZ;		// turn off LED indicator
   		}
#endif
   
   	// disable timer A interrupt to prevent re-entrance problems
  	TACCTL0 = 0;
  	
  	// Configure ADC to measure ch 1 & 0, multi channel -> THERMISTOR and SYSPWR
  	ADC10CTL1 = ADC10SSEL_3 | INCH_1 | CONSEQ_1;
  	ADC10DTC1 = 2;
  	ADC10CTL0 =  SREF_1 | REFBURST | REF2_5V | REFON | ADC10SR | ADC10SHT_3 | MSC | ADC10ON | ADC10IE ;
  	ADC10CTL0 &= ~ENC;                      // Enable conversion = 0
  	while (ADC10CTL1 & BUSY);               // Wait if ADC10 core is active
  	ADC10SA = (unsigned short)&adc_vals;    // Data buffer start
  	ADC10CTL0 |= (ENC | ADC10SC);           // Sampling and conversion start
	 
  	// go to LPM0 and wait for ADC interrupt   
  	__bis_SR_register(LPM0_bits + GIE);
  
  	thermistor 	= adc_vals[1];
  	sys_voltage = adc_vals[0];
	  
#if THERMISTOR_SENSING
   		// check the thermistor temperature
  		if ( PowerIsOn && (thermistor < ADCh0_70) ) 
  		{
      		P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
      		if(EnableSafetyChecks)	shutdown(OVERHEAT_SHUTDOWN);
  		}
#endif
 
#if LED_ENABLE_SENSING
		// Check that the LightCrafter is powered, that the LED_ANODE voltage is too high, and there is a connected light engine operating above -15 degC
	    if ( PowerIsOn && (!(P1IN & LED_ENABLE)) && (thermistor <= ADCh0_n15))		 
    	{
	   		P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
   			if(EnableSafetyChecks)	shutdown(LED_OVERVOLT_SHUTDOWN);
  		}
#endif


#if SYS_VOLTAGE_SENSING
		// First check absolute maximum voltage to avoid damaging parts
		if ( sys_voltage > MAX_SYS_VOLTAGE)  
		{
	  		P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
  			if(EnableSafetyChecks)	shutdown(LOW_BATT_SHUTDOWN);
  		}
  		
		// Wait until the correct number of sys_voltage measurements have been made
		if( sys_voltage_cnt < SYS_VOLTAGE_AVE_NUM )
		{
			// Add current sys_voltage to sum
			sys_voltage_sum = sys_voltage_sum + sys_voltage;
			
			// Increment counter
			sys_voltage_cnt++;
		}
		else	// Correct number of measurements have been made
		{
			// Calculate average
			sys_voltage_avg = sys_voltage_sum / SYS_VOLTAGE_AVE_NUM;
			
			// Check that average is within operating voltage, otherwise shutdown device
			if ( (sys_voltage_avg < LOW_SYS_VOLTAGE) || (sys_voltage_avg > HIGH_SYS_VOLTAGE) ) 
			{
	  			P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
  				if(EnableSafetyChecks)	shutdown(LOW_BATT_SHUTDOWN);
  			}
  			else // device is operating at an allowable voltage
			{
				// Reset averaging variables
				sys_voltage_sum = 0;
				sys_voltage_cnt = 0;
			}
		}
#endif

  
  	if(!(P3OUT & LED_ENABLEZ))
  	{
  		if(led_timeout++ >= LED_MAX_ON_TIME)
  		{
  			P3OUT  |= LED_ENABLEZ;
  		} 
  	}
  	// re-enable timer A interrupt
  	TACCTL0 = CCIE;
}

////////////////////////////////////////////////
// Port 1 interrupt service routine. 
//    Detects Power-On

#pragma vector=PORT1_VECTOR
__interrupt void Port1_ISR(void)
{
  uint08 active_interrupt = P1IFG;
  uint08 IntEdgeSel;
  if ( active_interrupt & SW_POWER ) {  // Was interrupt caused by power switch?
    // disable further Port 1 interrupts until we have serviced this one
    P1IE &= ~(SW_POWER | RED_EN | GRN_EN | BLU_EN);
    P1IFG &= ~SW_POWER;
    
    PowerIsOn = PowerIsOn ^ 0x01;
    if ( !PowerIsOn ) {
 	  //DM365 will set MSP_P2_5 HIGH when it is busy in writing bulk data into microSD or NAND flash
      //in such case prevent MSP430 to power down else cause corrupting the memory
	  if((P2IN & MSP_P2_5) == 0x00) 
	  {
 		  shutdown(NORMAL_SHUTDOWN);		 // Turn off DMD
 	  }
	  else
	  {
		  //Since user attempting to power down when saving solution the first thing that should happen after
		  //solution save is power down. So always set flag to '1' to make sure it will power down after
		  //saving solution.
		  PowerIsOn = 1;
	  }

 	  P1IFG = 0;                            // Clears all other pending interrupt
                                            // before proceeding after shutdown
#if FAN_ON
	  P4OUT &= ~(FAN_PWM);
#endif

    } 
    else 
    {
 	  //	  write_dlpc300_i2c(FPGA_DEV_ADDR, 0x20, 0x1, 0);  // switch to DM365 mode
#if FAN_ON
	  P4OUT |= FAN_PWM;
#endif
      powerup();
      P1IFG = 0;
    }
  } else if ( active_interrupt & (RED_EN | GRN_EN | BLU_EN ) ) {  // Was interrupt on of the LED enables?
    // disable further Port 1 interrupts until we have serviced this one
    P1IE  &= ~(RED_EN | GRN_EN | BLU_EN);
 	P1IFG &= ~(RED_EN | GRN_EN | BLU_EN);

	led_timeout = 0;
	P3OUT &= ~LED_ENABLEZ;
    
