GiWduL4/WiMi/Labortechnik/DMD/Texas Instruments-DLP/DLPLCRSoftwareBundle-3.0/DLP3000-C300REF-MSP430-SourceCode-v3.0/dlpc300_LightCrafter.c
#if LED_DRIVER_SENSING
  	// Configure ADC to measure ch 12, single channel -> LEDDRV_SENSE = .12 * (LED Current)
  	//	LED Current = 635mA, LEDDRV_SENSE = 0.76V
  	ADC10CTL1 =  ADC10SSEL_3 | INCH_12 | CONSEQ_0;
  	ADC10DTC1 = 1;
  	ADC10CTL0 = SREF_1 | REFBURST | REF2_5V | REFON | ADC10SR | ADC10SHT_3 | ADC10ON | ADC10IE ;
  	ADC10CTL0 &= ~ENC;                      // Enable conversion = 0
  	while (ADC10CTL1 & BUSY);               // Wait if ADC10 core is active
  	ADC10SA = (unsigned short)&adc_vals;    // Data buffer start
  	ADC10CTL0 |= (ENC | ADC10SC);           // Sampling and conversion start

   	// go to LPM0 and wait for ADC interrupt   
  	__bis_SR_register(LPM0_bits + GIE);
  
  	led_driver_sense = adc_vals[0];

   	// check the LED cable connection
    if ( (led_driver_sense > LED_OVERVOLTAGE) ) {
   		P2OUT &= ~SYS_FAULTZ;		// turn on LED indicator
   		if(EnableSafetyChecks)	shutdown(LED_OVERVOLT_SHUTDOWN);
  	}
#endif



    // Configure LED STROBES interrupt to next edge (rising / falling based on current state)
    IntEdgeSel  = P1IES;
    IntEdgeSel &=        ~(RED_EN | GRN_EN | BLU_EN);
    IntEdgeSel |= (P1IN & (RED_EN | GRN_EN | BLU_EN));  
    P1IES       = IntEdgeSel;
    // Clear interrupt flag if get set because of edge select operation
    P1IFG &= ~(RED_EN | GRN_EN | BLU_EN);
    P1IE  |=  (RED_EN | GRN_EN | BLU_EN);
  } else {                  // MSP_WAKEUP must have caused the interrupt
   	__bic_SR_register_on_exit(LPM3_bits);
  } 
    
  // set a timer to mask off further Port 1 interrupts
  WDTCTL = WDT_MDLY_32;                 // WDT Interval timer (32ms)
  IE1 |= WDTIE;                         // Enable WDT interrupt
  
  if(active_interrupt & SW_POWER)
  __delay_cycles(010000); // debounce

  // re-enable the power button interrupt
  P1IE |= (SW_POWER | RED_EN | GRN_EN | BLU_EN);
  if ( PowerIsOn )
    __bic_SR_register_on_exit(LPM4_bits);
  else
    __bic_SR_register_on_exit(LPM0_bits);
}

///////////////////////////////////////////////
// Port 2 interrupt service routine for response

#pragma vector=PORT2_VECTOR
__interrupt void Port2_ISR(void)
{
   uint08 active_interrupt = P2IFG;

 	if ( active_interrupt & PROG_EN_DM ) {  // Was interrupt caused by request from DM365 for SPI bus?
         // disable further Port 1 interrupts until we have serviced this one
    	P2IE &= ~PROG_EN_DM;
    	P1OUT |= BSL_TX_MSP;    // Drive TX high
    	P4OUT &= ~(RESETZ);	    // Place DLPC300 in reset
    	P4DIR |= RESETZ;        // Set RESETZ as output
    	P2DIR &= ~BSL_RX_MSP;   // Ensure that BSL_RX_MSP is an input
    	P1DIR |= BSL_TX_MSP;    // Set BSL_TX_MSP as output
    	
    	P3DIR |= SPIPROGZ;    	// Set SPIPROGZ as output
    	P3OUT &= ~(SPIPROGZ);   // Drive SPIPROGZ low to connect SPI from DM365 to DLPC300
        //P2DIR |= MSP_P2_5;		// Set MSP_P2_5 high
 	    while ( P2IN & PROG_EN_DM );  // Wait until PROG_EN_DM is lowered
        //__delay_cycles(500000);   // Wait for 500 ms to allow DM365 to respond success to command and prevent GUI from crashing   
		// Jump to BSL
		
		P4DIR &= ~RESETZ;
		P3OUT |= SPIPROGZ;

		if(P2IN & BSL_RX_MSP)
		{
			BCSCTL2 = 0;
			_bic_SR_register(0xFFFF);
			(*((voidFcn *)(BOOT_BSL_ENTRY)))();
		}
		else
		{
			P1OUT &= ~BSL_TX_MSP;
		}
 	}
   
    P2IES   = 0; 
    P2IFG   = 0;
    P2IE    = PROG_EN_DM;
}

// Watchdog ISR used to re-enable Port 1 interrupts
#pragma vector=WDT_VECTOR
__interrupt void Watchdog_ISR(void)
{

  // disable the watchdog since we don't need it again until after the next port 1 interrupt
  IE1 &= ~WDTIE;
}

// ADC10 interrupt service routine
#pragma vector=ADC10_VECTOR
__interrupt void ADC10_ISR(void)
{
    ADC10CTL0 &= ~ENC;                      // Disable conversion
    __bic_SR_register_on_exit(LPM0_bits);
}


void write_dlpc300_i2c(uint08 addr, uint08 subaddr, uint32 data, uint08 verify)
{
  uint32 read_data;
  uint08 num_written;
  uint08 i2c_array[5];
  
  i2c_array[0] =           subaddr;
  i2c_array[1] = (uint08) (data>>24);
  i2c_array[2] = (uint08) (data>>16);
  i2c_array[3] = (uint08) (data>>8);
  i2c_array[4] = (uint08) data;
  i2c_master_polled_write(addr, i2c_array, 5, &num_written, 30); 
    
  if ( verify ) {
    read_dlpc300_i2c(addr, subaddr, &read_data);

  }
}

void read_dlpc300_i2c(uint08 addr, uint08 subaddr, uint32* data)
{
  uint08 num_written, num_read;
  uint08 i2c_array[4];
  uint08 status;
  
  // setup the readback
  i2c_array[0] = (uint08) READ_REG_SELECT;
  i2c_array[1] =          subaddr;
  status = i2c_master_polled_write(addr, i2c_array, 2, &num_written, 30); 
  
  // flag an error if necessary
  if ( (status != 0) || num_written != 2 ) {
    *data = 0;
    return;
  }
    
  // perform the read
  status = i2c_master_polled_read(addr, i2c_array, 4, &num_read, 30); 
  
  // flag an error if necessary
  if ( (status != 0) || num_read != 4 ) {
    *data = 0;
    return;
  }
    
  // concatenate the bytes to make a word
  *data = (uint32)i2c_array[0]<<24 |
          (uint32)i2c_array[1]<<16 |
          (uint32)i2c_array[2]<<8  |
          (uint32)i2c_array[3];
}

void write_i2c_1byte(uint08 addr, uint08 subaddr, uint08 data)
{
  uint08 num_written, i2c_array[4];
  
  i2c_array[0] = subaddr;
  i2c_array[1] = data;
  i2c_master_polled_write(addr, i2c_array, 2, &num_written, 30); 
    
}

void read_i2c_1byte(uint08 addr, uint08 subaddr, uint08* data)
{
  uint08 status, num_written, num_read;
  
  status = i2c_master_polled_write(addr, &subaddr, 1, &num_written, 30);
  
  // no sense continuing if the slave does not respond
  if ( status == I2C_NO_ACK ) {
    return;
  }
  
  status = i2c_master_polled_read(addr, data, 1, &num_read, 30); 

}

// PowerUp function
void powerup(void)
{
	  volatile uint32 i;
	  
	  P4OUT |= PWREN_CORE;		// Turn on 2.5 V power supply
      __delay_cycles(120000);	// Delay 100ms for power supply sequencing
 
      P3OUT |= ( PWREN_INTF );		// Turn on 3.3 V power supply 
      P4DIR &= ~DM_3V3_PWR_SEQ; // Make sure 3.3V is controlled by core supply pull-up
      __delay_cycles(100000);   // Wait for 100 ms to release reset   
  
#if EVT
      P3DIR |= (SPIPROGZ | EXT_I2COE);      // When 3.3V is up, set SPIPROG, output EXT_I2COE for EVT boards
      										// to enable pull-ups on I2C
#else
      P3DIR |= (SPIPROGZ);      // When 3.3V is up, set SPIPROG
#endif
      P2DIR |= SYS_FAULTZ;		// When 3.3V is up, set SYS_FAULTZ to output
      P2DIR &= ~SYSRESETZ;		// When 3.3V is up, release DM365 reset by setting to input an using pull-up
      P4DIR &= ~RESETZ;			// Release reset to DLPC300 by setting to input an using pull-up
      P3OUT |= POWERGOOD | LED_ENABLEZ;       // Assert PowerGood with LEDs disabled

  	  
	 i = 0;    
      // wait for DLPC300 GPIO4 to go high
      while ( (P1IN & INIT_DONE_DPP) == 0 ) {
        i++;
        // 500000 / 6 - 1 , 500msec
        if ( i == 83332 )
          break;
      }
  		

  	  i = 0;
      // wait for DLPC300 GPIO4 to go low
      while ( (P1IN & INIT_DONE_DPP) == 1 ) {
        i++;
        // 500000 / 6 - 1 , 500msec
        if ( i == 83332 )
          break;
      }

  	  P2DIR &= ~SYSRESETZ;    // Release DM365 from reset by setting to input and using pull-up
      P2OUT &= ~SYS_PWRONZ;   // Turn System Power LED ON by setting SYS_PWRONZ low

      i2c_master_init();	 // I2C controller setup
      
	  // unpark the DMD
      write_dlpc300_i2c(DLPC300_DEV_ADDR, DMD_PARK_TRIGGER, 0, 0);

      EnableSafetyChecks = dlpc300_main_configure();
      
      P2OUT |= SYS_FAULTZ;		// turn off system fault LED indicator
          
      // Configure ADC to measure ch 13, single channel, 15 conversions  -> VRef2 ~ 0.9V
      ADC10CTL1 = ADC10DIV_4 | ADC10SSEL_3 | INCH_13 | CONSEQ_2;
      ADC10DTC1 = 15;
      ADC10CTL0 = SREF_1 | REFBURST | REF2_5V | REFON | ADC10SR | ADC10SHT_2 | MSC | ADC10ON | ADC10IE ;
      ADC10CTL0 &= ~ENC;                      // Enable conversion = 0
      while (ADC10CTL1 & BUSY);               // Wait if ADC10 core is active
      ADC10SA = (unsigned short)&adc_vals;    // Data buffer start
      ADC10CTL0 |= (ENC | ADC10SC);           // Sampling and conversion start
      
      // go to LPM0 and wait for ADC interrupt   
      __bis_SR_register(LPM0_bits + GIE);
      
      for ( i=0; i < 16; i++ ) {
      	VRef2 += adc_vals[i];
      }
      VRef2 = VRef2 / 15;
      
      
      // Configure ADC to measure ch 5, single channel, 15 conversions  -> DMD_VOLTAGE ~ 1.0V
      ADC10CTL1 = ADC10DIV_4 | ADC10SSEL_3 | INCH_5 | CONSEQ_2;
      ADC10DTC1 = 15;
      ADC10CTL0 = SREF_1 | REFBURST | REF2_5V | REFON | ADC10SR | ADC10SHT_2 | MSC | ADC10ON | ADC10IE ;
      ADC10CTL0 &= ~ENC;                      // Enable conversion = 0
      while (ADC10CTL1 & BUSY);               // Wait if ADC10 core is active
      ADC10SA = (unsigned short)&adc_vals;    // Data buffer start
      ADC10CTL0 |= (ENC | ADC10SC);           // Sampling and conversion start
      
      // go to LPM0 and wait for ADC interrupt   
      __bis_SR_register(LPM0_bits + GIE);
      
      for ( i=0; i < 16; i++ ) {
      	DMDVoltage += adc_vals[i];
      }
      DMDVoltage = DMDVoltage / 15;
      
      P3DIR |= (EXT_I2COE);        // When finished EXT_I2COE to output to indicate ASIC_READY
      
      // Start Timer
      TACCTL0 = CCIE;
      

