GiWduL4/WiMi/Labortechnik/DMD/Texas Instruments-DLP/DLPLCRSoftwareBundle-3.0/DLP3000-C300REF-MSP430-SourceCode-v3.0/dlpc300_LightCrafter.c
}



// call this function when either a fault occurs or the user requests shutdown
//  normal user generated shutdown - reason = 0
//  if the battery is low          - reason = 1
//  if LED overvoltage             - reason = 2
void shutdown(uint08 reason)
{
  
  	// enable interrupts to allow I2C to work
  	__bis_SR_register(GIE);

  	// turn off LEDs
  	write_dlpc300_i2c(DLPC300_DEV_ADDR, LED_CONTROL, 0, 1);

	// park the DMD
  	write_dlpc300_i2c(DLPC300_DEV_ADDR, DMD_PARK_TRIGGER, 1, 0);

  	// turn off timers
  	TACCTL0 = 0;
  	TBCCTL0 = 0;
  
  	// make sure the watchdog interrupt is off
  	IE1 &= ~WDTIE;
  
  	// ADC10 controls can only be modified when ENC = 0, so clear it first,
  	//  then clear the rest of the register
  	ADC10CTL0 &= ~ENC;
  	ADC10CTL0 = 0;
  
  	P2OUT |= SYS_PWRONZ;   // Turn System Power LED Off
 
  	P3OUT &= ~(POWERGOOD);
  	P3OUT |= LED_ENABLEZ;    // De-assert PowerGood and disable LEDs
  
  	UCB0CTL1 |= UCSWRST;    // hold I2C in reset to conserve power
	  
  	__delay_cycles(510);	  // Delay 510us to let DMD get parked
  
  	P2OUT &= ~SYSRESETZ;   // Hold DM365 in Reset
  	P2DIR |= SYSRESETZ;    // Allow shutdown to hold SYSRESETZ low
  	P3DIR &= ~(EXT_I2COE | SPIPROGZ);		// Set pins connected to DM365 to input before shutting down its I/O
	//  P2DIR &= ~SYS_FAULTZ;		// When 3.3V is down, set SYS_FAULTZ to input
  	P4OUT &= ~(RESETZ | DM_3V3_PWR_SEQ);	// Place in reset, shut DM365 3.3V
  
  	P4DIR |= (RESETZ | DM_3V3_PWR_SEQ); // Make sure DM365 3.3V is off
  
  	__delay_cycles(100000);   // Wait for 100 ms after reset and before 1.8V power-off   
 
  	P3OUT &= ~PWREN_INTF;		// Turn off 3.3 V power supply 
  	// set I/Os connected to DLPC300 to input
  	P1DIR = 0;
	  
  	P4OUT &= ~PWREN_CORE;		// Turn off 2.5 V power supply

  	// disable global interrupts
  	__bic_SR_register(GIE);

  	// Blink the System fault LED to indicate failure -- Added 08-29-2012
  	//  LOW_BATT_SHUTDOWN : ON for 5sec OFF for 500msec
  	//  LED_OVERVOLT_SHUTDOWN : ON for 5sec OFF for 5sec
  	//  OVERHEAT_SHUTDOWN : ON 1.5sec off 1sec
  	//  LED_FAULT_SHUTDOWN : ON for 1sec off for 10sec

	switch( reason )
	{
		case 0:
			// Continue normal shutdown mode
			break;
		case 1:	//LOW_BATT_SHUTDOWN
			blink_sys_fault_LED(5000,500);
			break;
		case 2: //LED_OVERVOLT_SHUTDOWN
			blink_sys_fault_LED(5000,5000);
			break;
		case 3: //OVERHEAT_SHUTDOWN
			blink_sys_fault_LED(1500,1000);
			break;
		case 4: //LED_FAULT_SHUTDOWN
			blink_sys_fault_LED(1000,10000);
			break;
	}
}

unsigned int delay_ms( uint16 ms )
{
	uint16 i;
	for( i=0; i < ms; i++)
	{
		// Delay for 1ms
		__delay_cycles(1000);
	}
	return(i);	// Return number of ms delayed
}

unsigned int blink_sys_fault_LED( uint16 on_time, uint16 off_time )
{
	// Stop watchdog timer to prevent time out reset
	WDTCTL = WDTPW + WDTHOLD + WDTNMI;
	
	// Set LED pin as output
	P2DIR |= SYS_FAULTZ;
	
	// Blink LED until complete reboot
	while(1)
	{
		P2OUT &= 0;				// Turn on LED indicator
		delay_ms(on_time);		// Keep LED on for off_time in ms
		P2OUT |= SYS_FAULTZ;	// Turn off LED indicator
		delay_ms(off_time);		// Keep LED off for on_time in ms
	}
}

